package day02;
//变量的演示
public class VarDemo {
	public static void main(String[] args) {
		/*
		 * 变量的练习:
		 * 1.声明一个整型变量，名为a
		 *   声明三个整型变量，名为b,c,d
		 * 2.声明整型变量e并赋值为250
		 *   声明整型变量f
		 *   给f赋值为250
		 * 3.输出m的值-----------------???
		 *   声明整型变量n，输出n的值-----???
		 *   声明整型变量o并赋值为25.6----???
		 *   声明整型变量p并赋值为100
		 *     在p本身基础之上增200，输出p
		 * 4.声明几个正确的变量名和几个错误的变量名
		 */
		
		
		/*
		//4.变量的命名:
		//  1)只能包含字母、数字、_和$符，
		//    并且不能以数字开头
		//  2)严格区分大小写
		//  3)不能使用关键字
		//  4)可以中文命名，但不建议
		//    建议:见名知意、驼峰命名法
		int a1,a_6$;
		//int a*b; //编译错误，不能包含*号
		//int 1a; //编译错误，不能以数字开头
		//int class; //编译错误，不能使用关键字
		int 年龄; //正确，但不建议
		int age; //建议:见名知意
		int score,myScore,myJavaScore; //驼峰命名法
		*/
		
		
		
		/*
		//3.变量的使用:
		//  1)变量的使用必须与数据类型匹配
		//  2)变量用之前必须声明并初始化
		//  3)对变量的使用就是对它存的那个数的使用
		//System.out.println(a); //编译错误，a未声明
		//int a;
		//System.out.println(a); //编译错误，a未初始化
		int b=5;
		System.out.println(b); //5
		
		int m=10; //声明整型变量m并赋值为10
		m=m+100; //取出m的值10，加100后，赋值给m
		         //在m本身基础之上增100
		System.out.println(m); //110
		
		//int n=25.678; //编译错误，数据类型不匹配
		*/
		
		/*
		//2.变量的初始化:第一次赋值
		int a=250; //声明同时初始化
		           //声明整型变量a并赋值为250
		int b; //声明整型变量b
		b=250; //给b赋值为250
		*/
		
		/*
		//1.变量的声明:
		int a; //声明整型变量，名为a
		int b,c,d; //声明三个整型变量，名为b,c,d
		*/
		
	}
}
